app/controllers/home_controller.rb

	def index
		@tweets = current_user.all_tweets
		@last_tweet = current_user.tweets.last
---
SELECT * FROM "tweets" WHERE ("tweets".user_id = 72) ORDER BY tweets.id DESC LIMIT 1

	def show
		@user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'adonis_hilll') LIMIT 1

  def toggle_follow
    @user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'adonis_hilll') LIMIT 1

  def toggle_follow_via_ajax
    user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'virginie') LIMIT 1

	def remove_friend
		friend = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'virginie') LIMIT 1