app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("created_at", "user_id", "message") VALUES('2014-08-19 02:03:41', 72, 'What the hell is this?')
---
	def create
		tweet = current_user.tweets.build(params[:tweet])
		tweet.message = tweet.message[0..140]
		tweet.created_at = Time.now #HACK