app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2014-08-18 06:15:09', '2014-08-18 06:15:09', 'SterlingSavariau', 'a6a3fbfc0504285acc08aa6d0b1c9921fb69411b', '267df1d6b67dc82d31a94b9b4422b8863686d05d', 'sterling.savariau@gmail.com')